{
  "type": "Article",
  "title": "Exact Match Anchor Text is Dangerous in 2018",
  "real_title": "Exact Match Anchor Text is Dangerous in 2018",
  "keywords": "exact match anchor text",
  "date": "2018-08-16T19:26:21-04:00",
  "thumbnail": "/images/uploads/copy-of-why-exact-match-anchor-text-is-so-dangerous-in-2018.jpg",
  "summary": "Building too many exact match anchor text links could be putting your site at risk of a Penguin penalty. Find out the best practices for building links here. ",
  "body": "[2018 Ultimate Link Building Guide.](<2018 Ultimate Link Building Guide.>)Anchor text refers to the clickable words that link from one page to another. It is the part of a hyperlink that you can see. The relevance of anchor text to search engine results pages (SERPs) cannot be overstated.  \n\nGoogle and other search engines read this text and evaluate the relevance of the target. Sites with more relevant anchor text will have a better chance of being found in search and should rank higher.    \n\n## What is Exact Match Anchor Text\n\nExact match anchor text is a link that only uses your specific targeted keyword phrase. For example, if you are targeting \"influencer marketing\", you would make the words \"influencer marketing\" the anchor text and it would be your hyperlink.\n\nHowever, without the proper knowledge about how to build your links, you could be putting your site at risk of getting penalized if you use too much exact match anchor text. \n\nTo build the most relevant and useful backlink profile, you want to make sure it appears natural and organic. The best way to do that is to use different types of anchor text links.  \n\n## What are Other Types of Anchor Text?\n\nIt’s best to build a link profile that [includes other link types](https://www.hybridtraffic.net/single-post/Exact-Anchor-Text-Guidelines-for-2018) including URL, generic, partial match, and brand. \n\n* URL: These are also called naked links and are the exact URL where you want to send traffic.\n* Generic: Links such as “see it here”, “this content”, and “find this” are examples of generic links.\n* Partial match: Links that either contain additional words along with your anchor text phrase or only some of the words. \n* Brand: These links include the brand or business name as part of the anchor text. \n\n## What is the Correct Percentage of Link Types?\n\nSEO experts don’t all agree on the optimal exact percentages of links. And many of them prefer to keep their research results and advice private and confidential. \n\nThe SEO experts who have shared their research results publicly have shown that the exact match recommended percentages are very low. \n\nTake a look at Nathan Gotch’s [Anchor Text updated for 2018](https://www.gotchseo.com/anchor-text/). You will see that he recommends using less than 1% of exact match anchor text when building your link profile. \n\n## The New Rules\n\nBuilding links is the best way to improve SEO. However, search engines do not want and will punish those who try to [manipulate search engine rankings](https://smallbusiness.yahoo.com/advisor/5-reasons-why-exact-match-anchor-text-bad-165127744.html). \n\nSome of the ways search engines determine if a link is natural or not are: \n\n* How relevant is the site where the link is pointing?\n* What text is included in the link?\n* Where is the link placed?\n* Is the link dofollow or nofollow?\n\n## Looks like Manipulation\n\nWhen building your link profile, do it from the perspective of a search engine. Gone are the days when using exact match keywords boosted your rankings in search. \n\nIt is increasingly becoming just the opposite and is viewed as manipulation. When [Google's Penguin update](https://searchengineland.com/library/google/google-penguin-update) rolled out in April 2012, sites with excessive exact match links dropped in the rankings. \n\nOne of the reasons for this update was to enable Google to pick up on those sites that were buying links or getting them through link networks. \n\nThese methods of link building are also referred to as black hat and should always be avoided. Instead, webmasters should spend more time building authoritative, natural, and relevant links.\n\nAs website owners, we want to do our best to avoid hurting our search engine rankings. This means not using too much exact match anchor text to avoid getting hit with a Penguin penalty. \n\nYour percentage of exact match anchor text should be somewhere around 1% - 2%. \n\n## Doesn’t Look Natural\n\nThink about some of the articles you read and how their links appear. Remember, you are writing for humans not bots. Exact match anchors often don't look natural in the context of the page where they occur. \n\nWhen you try to force a specific exact match anchor text on a page, the reader and the search engines will notice. [Try reading it out loud](https://yoast.com/what-is-anchor-text/). If it doesn't sound natural, it isn't and don't use it.\n\nPartial match links are a good way to link to another website naturally. Generic links are also very natural and safe to use.\n\n## Looks Too Much Like Advertising\n\nIf you use too many exact match anchor text links your readers will view them as spam or outright advertising. \n\nIf you stuff your exact match anchor text with keywords that aren't relevant to the content on your page or the linked content, keep in mind that you aren't fooling anyone, including Google.\n\nIt is important to remember when building your link profile that you minimize the amount of exact match anchor text to avoid triggering a Penguin penalty.\n\nBe sure to use a variety of links, make sure they are relevant, and focus on links that appear natural. Choose sights whose audiences are your target customers. \n\nFor more information on exact match anchor text percentages, download our brand new [**2018 Ultimate Link Building Guide**](http://go.vazoola.com/ultimate-link-building-guide). \n\n[<img src=\"/images/uploads/link-building-white-paper-banner.jpg\">](http://go.vazoola.com/ultimate-link-building-guide)"
}