{
  "type": "Article",
  "title": "Influencer Marketing Statistics: State of Influencer Marketing 2018",
  "keywords": "influencer marketing statistics",
  "date": "2018-05-08T18:36:23-05:00",
  "thumbnail": "/images/uploads/vazoola-influencer-marketing-statistics.png",
  "summary": "Does influencer marketing work? Three recent studies provide influencer marketing statistics on just how much brands are profiting from using influencers to market their products. Find out how they can benefit you. ",
  "body": "Does influencer marketing work? Three recent studies provide **influencer marketing statistics** on just how much brands are profiting from using influencers to market their products. \n\n## Linqua State of Influencer Marketing 2018\n\nIn their [State of Influencer Marketing 2018 study](http://www.linqia.com/insights/report-the-state-of-influencer-marketing-2018/), Linqua interviewed 181 marketers and their agencies. They found: \n\n* 92% of the 86% of marketers who used influencer marketing in 2017 found it to be effective.\n* 39% of marketers plan to increase spending on influencers in 2018.\n* 51% report that influencer content outperforms brand-created content.\n\nBig trends they cite include having a more integrated strategy in-house and out and using a broad mix of influencers from huge celebrities to small, but very niche influencers. \n\n## Association of National Advertisers (ANA) Study\n\nThe [Association of National Advertisers (ANA)](https://www.ana.net/content/show/id/48437) study released April 3, 2018 confirms that advertisers plan to increase spending. 42% of their 158 client-side marketers plan to spend more this year. \n\nANA CEO Bob Liodice said, “We’ve found that a growing number of marketers are turning to influencers to help them combat ad blocking, leverage creative content in an authentic way, drive engagement, and reach millennial and gen Z audiences who avidly follow and genuinely trust social media celebrities.”\n\nThey found that 75% of national advertisers are already using influencers to market their brands. \n\n## RhythmOne’s Full-Year 2017 Highlights\n\nGlobal advertising technology company RhythmOne released their [2017 Influencer Marketing Benchmarks Report](https://www.bizjournals.com/birmingham/businesswire/press_releases/Alabama/2018/04/30/20180430005154).  \n\n* Advertisers averaged $12.21 in earned media value (EMV) for every $1.00 of spend – an increase of 4.4% over 2016.\n* Cost per engagement decreased by 74.2% from 2016.\n\nThis is the fifth year RhythmOne has released their annual report. The longer brands focus on influencer marketing, the better they can fine-tune what works and bring costs down. \n\n## Most Popular Platforms for Influencer Marketing\n\n36% of respondents to the ANA study ranked_ **Instagram**_ as the _most important channel_ followed by Facebook.  92% of advertisers Linqua interviewed agreed. \n\nRhythmOne also mentioned Snapchat was a significant driver of engagement. \n\nWould it surprise you to know that blogs were #3 in the Linqua study? At 71% in 2018, blogs are up from only 46% in 2017. \n\n## Brands Spending Money Because They're Seeing Results\n\nAn [exceptional video](https://www.cbsnews.com/news/the-rise-of-social-media-influencers/) created by CBS News illustrates exactly why influencer marketing has taken off. This is a must-watch video for understanding how and why using influencers works. \n\nAlex Bolen, chief executive of Oscar De La Renta, credits influencers with causing their handbag business to take off, doubling their handbag production. \n\nBeauty brand executive [John Dempsey](http://coveteur.com/2016/08/03/beauty-brand-mogul-john-demsey-estee-lauder-companies/) says, \"People show the money when they see the results.\" He refers to influencers as \"the new media stars\". \n\n## Influencer Marketing Statistics\n\nClick the links to each report mentioned above to download the full versions of these studies and see even more current statistics. \n\nWhat we have covered here is just a splash of some of the most compelling statistics. There is a much deeper pool to draw from in the downloads.  \n\n## Influencer Marketing Case Studies\n\nConvinced about the influencer marketing statistics, but not sure what influencer marketing can do for you? Check out these [Influencer Marketing Case Studies](https://neoreach.com/case-studies/) for ideas. \n\nThen pop over to our home page to [leverage our vast pool of influencers](https://www.vazoola.com/) to benefit your own brand."
}