{
  "type": "Article",
  "title": "Link Building Strategies (2018)",
  "real_title": "Link Building Strategies 2018 Simplified: Dos and Don'ts",
  "keywords": "link building",
  "date": "2018-06-21T21:16:01-05:00",
  "summary": "Understanding the basics of link building best practices is simple. Link building simplified explains and reduces your risk of making still-too-common mistakes. ",
  "body": "Would you like your website to rank at the top of Google for the searches most likely to lead to income for you? Who wouldn't? \n\nThe #1 ranking factor used by Google is inbound links. While some claim links are not as important anymore, David Farkas makes a strong argument why [Links Remain the #1 Ranking Factor in 2018](https://theupperranks.com/blog/backlinks/). \n\nHe cites extensive, comprehensive research undertaken by Stone Temple in 2017 [proving links remain a powerful ranking factor](https://www.stonetemple.com/link-as-a-ranking-factor/). \n\n## Link Building Strategies:  Relevancy Matters Most\n\nWhen it comes to link building strategy, nothing is more important than only building highly relevant links. If you have a choice between a higher authority link that is not relevant and a lower authority link that is, choose the relevant link every time. \n\nAvoid having incoming links from sites and content that isn't related to yours. \n\n## How Long Will It Take / How Many Links Do I Need? \n\nAsking how many links your site needs to rank and how long it takes is counter-productive. The accurate answer is \"it depends\" on the competition for the keyword phrases you want. \n\nThe more sites vying for those coveted page one spots, the more authority you need to build and the longer it will take. Longer keyword phrases are generally easier than short, money phrases. \n\nIf someone claims they ranked a page without incoming links, they either have no competition to speak of or are ranking for a phrase that doesn't matter. \n\n## What Matters When It Comes to Targeting Keyword Phrases\n\nAll keyword phrases are not created equal. The ones that really matter are for searches made by people ready to buy what you are offering. \n\nA common SEO trick is to show examples of first position rankings for long keyword phrases that have no competition and almost no searches. \n\nRanking for phrases that don't lead to sales means little in the big scheme of things. What you want is to rank for the phrases that increase your income. \n\n## Do Your Keyword Research First \n\nAvoid wasting your time and money publishing content or building links that won't matter. [Use this keyword research guide](http://growmap.com/powerful-keyword-research/) and the free keyword research tool it suggests. \n\nPay special attention to the note explaining that competition related to buying keyword phrases for ads is not the same as how competitive it will be to rank your site organically. \n\nPrioritize what keywords are most important to succeeding in your niche. Then start [writing your pillar content first](https://pepperlandmarketing.com/blog/pros-and-cons-of-pillar-content/). Create one page or post for each keyword phrase. \n\nYoast is now calling pillar content [cornerstone content](https://yoast.com/rank-with-that-cornerstone-content/). \n\n  \n\n## Use Safe Link Building Strategies\n\nMaking mistakes while link building can be very costly. Tripping a Google algorithm can lead to loss of traffic. Building unnatural link profiles can result in penalties or even de-indexing. \n\nWorst case, some have decided they need to abandon the domain they spent years or maybe even decades building because they have been unable to recover from a penalty. \n\nTake this seriously enough to avoid making these serious errors. Focus on relevancy, quality, and maintaining a natural link profle for safe link building."
}