{
  "type": "Article",
  "title": "Link Building Strategies (2018)",
  "real_title": "Link Building Strategies 2018 Simplified: Dos and Don'ts",
  "keywords": "link building strategies",
  "date": "2018-06-21T21:16:01-05:00",
  "thumbnail": "/images/uploads/link-building-strategies-2018-simplified_-dos-and-don-ts.jpg",
  "summary": "Understanding the basics of link building strategies and best practices is simple. Link building simplified explains and reduces your risk of making still too common mistakes. ",
  "body": "Would you like your website to rank at the top of Google for the searches most likely to lead to income for you? Who wouldn't? \n\nThe #1 ranking factor used by Google is inbound links. While some claim links are not as important anymore, David Farkas makes a strong argument why [Links Remain the #1 Ranking Factor in 2018](https://theupperranks.com/blog/backlinks/). \n\nHe cites extensive, comprehensive research undertaken by Stone Temple in 2017 [proving links remain a powerful ranking factor](https://www.stonetemple.com/link-as-a-ranking-factor/). \n\n## Link Building Strategies:  Relevancy Matters Most\n\nWhen it comes to link building strategy, nothing is more important than only building highly relevant links. If you have a choice between a higher authority link that is not relevant and a lower authority link that is, choose the relevant link every time. \n\nAvoid having incoming links from sites and content that isn't related to yours. \n\n## How Long Will It Take / How Many Links Do I Need?\n\nAsking how many links your site needs to rank and how long it takes is counter-productive. The accurate answer is \"it depends\" on the competition for the keyword phrases you want. \n\nThe more sites vying for those coveted page one spots, the more authority you need to build and the longer it will take. Longer keyword phrases are generally easier than short, money phrases. \n\nIf someone claims they ranked a page without incoming links, they either have no competition to speak of or are ranking for a phrase that doesn't matter. \n\n## Money Targeted Keyword Phrases\n\nAll keyword phrases are not created equal. What counts most are keywords for searches made by people ready to buy what you are offering. \n\nA common SEO trick is to show examples of first position rankings for long keyword phrases that have no competition and almost no searches. \n\nRanking for phrases that don't lead to sales means little in the big scheme of things. What you want is to rank for the phrases that increase your income. \n\n## Do Your Keyword Research First\n\nAvoid wasting your time and money publishing content or building links that won't matter. [Use this keyword research guide](http://growmap.com/powerful-keyword-research/) and the free keyword research tool it suggests. \n\nPay special attention to the note explaining that competition related to buying keyword phrases for ads is not the same as how competitive it will be to rank your site organically. \n\nPrioritize what keywords are most important to succeeding in your niche. Then start [writing your pillar content first](https://pepperlandmarketing.com/blog/pros-and-cons-of-pillar-content/). Create one page or post for each keyword phrase. \n\nYoast is now calling pillar content [cornerstone content](https://yoast.com/rank-with-that-cornerstone-content/). They are the same thing. \n\n## Quality Content Matters\n\nPublishing poor quality content that no one will read, share, or link to is still widely practiced, but certainly not recommended. \n\nTop quality content will attract more links and end up with higher page authority which makes it more valuable for SEO as well as your potential buyers. \n\nHere are the key factors related to quality content: \n\n* **Content length**\n\nWhile there is no consensus on how long is long enough, 700 words is a good minimum. Neil Patel [strongly recommends](https://neilpatel.com/blog/long-blog-articles/) and regularly publishes content of 2000-2250 words. \n\n* **Add visual media**\n\nCompelling images and videos, colorful and informative graphs, and quality infographics are important to attracting and holding viewers' attention. This is especially true with the high percentage of viewers using mobile devices. \n\n* **Include current statistics**\n\nThe #1 strategy for attracting incoming links from major sites is including current statistics in your content. By providing many statistics, you increase the likelihood of a writer using one or more and recommending their readers click through to your site. \n\n* **Dated versus undated content**\n\nRemoving the dates from content is popular with some publishers. They feel that visitors seeing older dates may immediately leave. \n\nBut the problem with this practice is that they also cannot tell how old the content is. It is particularly problematic for topics that require current information or that may have experienced major changes recently or even in years past. \n\nJournalists and serious writers for major sites are more likely to find another source than to try to determine how old your information is, depriving you of potentially valuable shares and links. \n\n## Local SEO\n\nEvery local business should claim all the major local listings they can. These are links that are easy to obtain and that bring in traffic. \n\nThere are dozens of map and directory sites such as Google, Yahoo, Superpages, and many others. Add to that city directories, communities like Yelp and MerchantCircle, and niche directories. \n\nBusinesses can claim from dozens to hundreds of listings that are still worth having. Each of them may only bring you one visitor a year, but that visitor may become a customer. \n\nDo avoid any poor quality directories. If anyone can get listed with no criterion for qualification, that may be a directory to avoid. \n\nThere are listing providers that make obtaining these links easier - for a price. They include Localeze, Moz Local, UBL, and Yext. \n\nBusinesses that operate online or are not strictly local can also benefit from these directory listings provided they are willing to share their physical address and phone number online. (Some directories will allow you to hide this information, but most will not.)\n\n## Do Not Overdo Exact Match Anchor Text\n\nYears ago it was a common practice to build links using the exact phrase you hoped your site would rank for in search engines. \n\nSince Google's Penguin algorithm, it is highly recommended to vary your anchor text. The most cautious SEOs will only build one link to any given phrase. \n\nMore advanced SEOs will use tools to monitor the percentage of each type of incoming link and adjust their link building anchor text to keep within particular percentages. \n\n## Types of Links\n\nThere are multiple ways to list types of links including what type of anchor text they use. This list is simply what kind of link building is involved. \n\n* Natural / organic\n* Blog outreach\n* Self-created (comments, forums, Q&A sites like Quora, guest posts)\n* Social profiles\n\nA common mistake is to only build the easy links and ignore those that are more challenging to get. This is what separates quality link-building from cheap and risky practices. \n\nNever focus only on a particular DA range or only build comment and forum links. A natural link profile requires a mix of link types and sites. \n\n## Infographics\n\nWhile infographics in general may be less popular than they once were as a link-building technique, well-researched and designed infographics can still work. \n\nFocus on these factors when creating infographics: \n\n* Current research and statistics\n* Colorful, eye-pleasing design\n* Logical flow of information\n* Substance\n\nMake sure they are not overly promotional or the largest sites will refuse to publish them. And don't be greedy about links. Sites are more likely to give you one link to the page hosting the infographic rather than two with the second one going to a home page. \n\n## Link Building Tools\n\nBeginning link builders can start with free tools like Ubersuggest (discussed earlier) and the free versions of the Moz toolbar, Majestic SEO, and BuzzSumo. \n\nSerious SEOs use a variety of advanced tools including Premium versions of Ahrefs, BuzzSumo, Dibz, Majestic, Moz, and Screaming Frog. \n\nFor outreach, they use Whois searches and Hunter.io (free and Premium) to find email addresses. \n\n## Use Safe Link Building Strategies\n\nMaking mistakes while link building can be very costly. Tripping a Google algorithm can lead to loss of traffic. Building unnatural link profiles can result in penalties or even de-indexing. \n\nWorst case, some have decided they need to abandon the domain they spent years or maybe even decades building because they have been unable to recover from a penalty. \n\nTake this seriously enough to avoid risky practices. Focus on relevancy, quality, and maintaining a natural link profle for safe link building.\n\n## Link Building Strategies\n\nThere are many advanced link building strategies. Two of the most common are: \n\n* Broken Link Building\n* Backlinko Brian Dean Skyscraper Technique\n\nWe explain all of the information above in greater detail in our free Link Building Strategy White Paper download."
}