{
  "type": "Paper",
  "title": "New for 2018 Ultimate Link Building Guide",
  "real_title": "New for 2018 Ultimate Link Building Guide",
  "keywords": "Link Building",
  "date": "2018-08-22T15:31:48-04:00",
  "thumbnail": "/images/uploads/link-building-white-paper-banner.jpg",
  "summary": "Ignoring SEO and hoping your site do fine without it can hurt you. Even if you do not choose to build links, you should know how to analyze your link profile and guard against negative SEO.",
  "body": "# Table of Contents\n\nUltimate Guide to Link Building..............................................................................................................................1\nPREFACE: What You Don’t Know Can Hurt You...............................................................................................5\nUltimate Link Building Guide 2018........................................................................................................................5\n\n1.  4.7 Understanding Co-Citations\t11\n2. What is a Natural Link Profile?\t11\n   5.1 Average Percentages of Types of Links\t11\n   5.2 Gotch SEO Anchor Text Percentages\t11\n   5.3 Serpstat Anchor Text Percentages\t12\n3. Featured Snippets\t12\n   6.1 Ahref’s How to Find and Steal Featured Snippets Manually\t12\n   6.2 Automated Featured Snippet Tools\t13\n4. Avoid These Common Mistakes\t14\n5. Monitoring Your Backlink Profile\t14\n   8.1 Negative SEO\t15\n   8.2 Google Advice on Viewing Incoming Links\t15\n6. Recovering From Penalties\t15\n7. Manual Penalties\t16\n   10.1 Unnatural Inbound Links\t16\n   10.2 Unnatural Outbound Links\t16\n8. Algorithmic Penalties\t16\n   11.1 Panda Penalty\t17\n   11.2 Penguin Penalty\t17\n   11.3 Mobile Friendly Ranking Factor\t17\n9. SEO Tools\t18\n   12.1 Ahrefs\t18\n   12.2 Majestic SEO\t19\n   12.3 LinkResearch Tools\t19\n   12.4 Moz Toolbar\t19\n   12.5 SEMrush\t20\n10. SEO Crawling Tools\t21\n    13.1 DeepCrawl\t21\n    13.2 Screaming Frog\t21\n    13.3 Sitebulb\t21\n    13.4 Which Crawling Tool is Best?\t22\n11. Data Intelligence Tools\t22\n    14.1 BuzzSumo\t22\n    14.2 Kerboo Data Intelligence\t22\n    14.3 SEOClarity for Market Intel\t22\n    14.4 SEMrush\t22\n    14.5 SpyFu\t22\n12. Tools for Finding Influencers\t23\n    15.1 BuzzSumo\t23\n    15.2 Klear\t23\n    15.3 Klout\t23\n    15.4 Kred\t23\n    15.5 Leveraging Influential Content Marketers\t23\n13. Outreach Tools\t24\n    16.1 Dibz.me\t24\n    16.2 Hunter.io\t24\n14. On-page SEO\t24\n15. Content as an SEO Strategy\t24\n    18.1 Quality Content Defined\t25\n    18.2 How to Create Quality Content\t25\n    18.3 Add Compelling Media to Increase Views, Shares, and Links\t26\n    18.4 You Get What You Pay For\t26\n    18.5 Plagiarism Checkers\t26\n16. SEO Success Stories\t27\n    19.1 Top SEO Spot Lands Nationwide Deal with Best Buy\t27\n    19.2 SEO Success Stories: Hasan’s online traffic increased 300+% in 6 months; 10x quality and relevant leads compared to previous; Jade saw a 150% increase in website visits and almost 50% increase in sales for an ecommerce site.\t27\n    19.3 Hotel Success Story: Room rates increased by 11.5%; occupancy rates doubled. During the busy time of the year, they went from 40% to 80% occupancy and during the slow time of the year they went from 20% to 40% occupancy.\t27\n    19.4 Verruca Success Story: 88,000 Impressions and 1,574 Clicks across 684 keywords, all of which appear with an average position of 9th within 6 months.\t27\n17. Why You Should Not Wait to Get Started\t27\n    ![Vazoola Premier Link Building & Influencer Marketing Platform](/images/uploads/vazoola-logo-for-white-paper.png)\n    ## PREFACE: What You Don’t Know Can Hurt You\n    You may be tempted to ignore SEO and hope your site will do fine without it. The problem with doing so is that what you don’t know can hurt you.\n    Many site owners have endured the pain, lost time, and expense of trying to recover from penalties in spite of never having built links intentionally.\n    Even if you do not choose to build links yourself, knowing how to analyze your link profile and guard against negative SEO is imperative.\n    Read on to find out how.\n    # Ultimate Link Building Guide 2018\n    While Google may claim that links are not as important as they once were, every ranking factor publication put out by SEOs who do testing shows they are still the [\\#1 factor in getting a site to rank](https://theupperranks.com/blog/backlinks/).\n    Stone Temple did extensive research in 2017 [proving links remain a powerful ranking factor](https://www.stonetemple.com/link-as-a-ranking-factor/).\n    Attracting links organically by publishing exceptional content could work, but only if the content is so well-promoted that writers can find it.\n    If a site does not have enough authority for its content to appear in search, it surely will not be found in a search engine.\n    Because journalists and bloggers primarily use search engines when researching, if your content is not visible there it is unlikely to end up linked to in their content.\n    That leaves social media and outreach to build links. So link building will continue to be necessary into the foreseeable future.\n    ## 1.\tDo Keyword Research First\n    Knowing what keyword phrases are most important to your site and business is the first step. It guides what content you create, publish, and promote and what links you want to acquire.\n    SEOs use many premium tools which we will discuss later in this paper. But the free [Ubersuggest keyword research tool ](https://neilpatel.com/ubersuggest/)is sufficient to get started. It pulls data from Google which only those who have high AdWords spends can access directly now.\n    Start with the general words that describe what you offer. Then follow the tips on [how to use Ubersuggest here](http://growmap.com/powerful-keyword-research/).\n    Narrow your keyword phrases down to those that are highly relevant. Decide by asking yourself whether someone searching for that phrase would be specifically looking for what you offer.\n    ## 1.1 Organizing Your Keyword Research\n    Keyword research can be exported into spreadsheets. While many exclusively use spreadsheets, others prefer a more visual method.\n    The free project management tool Trello is ideal for prioritizing your keywords. You can learn to use it in ten minutes. See this [Trello 101 to get started](https://trello.com/guide/trello-101).\n    Create columns for:\n\n* priority\n* too general\n* too competitive\n* specific niches\n* low priority\n  Then create a card for each keyword phrase showing the keyword, search volume, CPC, and competition value on the front of the card.\n  Easily sort cards by priority. Create one piece of pillar content for each keyword phrase and add the URL of that content to the card.\n  Then start building links to that content. Pillar content is also referred to as cornerstone or flagship content.\n  ## 2.\tQuality of Links\n  Before you build links, get familiar with how to judge the quality of a site. Various companies have provided metrics to assist in site evaluation.\n  The most commonly used is the Moz Domain Authority (DA). Install the free Moz toolbar in your browser to check the DA of any site. Just navigate to a site and activate the toolbar.\n  Also available on the toolbar is Page Authority (PA). Where DA is Moz’ estimate of the authority of the main URL of that domain, PA is the authority of any individual page.\n  URL stands for uniform resource locator. It is what you type into your browser to go to a site online and how that content is found and displayed to you.\n  It is important to note that Google states that they score pages on a per URL basis, not over a full domain. But it is still useful to have some idea of the authority a domain may pass to a particular page using Moz’ DA.\n  Although other tools pull data from Moz, they draw from an older version that is not updated as frequently. So the data on the toolbar is the most accurate.\n  Other metrics available from Moz are MozTrust (mT) and MozRank (mR). On the toolbar, click the Page Analysis (first icon on the left next to “Moz”) to get to these.\n  Then click on Link Metrics. If a site has a mR or mT, you will see it on that page along with PA and DA.\n  ## 2.1 Relevance is Extremely Important\n  A pervasive mistake in building links is not to put enough emphasis on relevance. An incoming link from a highly related site is much more valuable than a link from a higher value but less related site.\n  Focus on getting many very relevant sites in your niche to link to your content. A link from a relevant site is more important than a link from any unrelated site.\n  Links from content specifically about your keyword phrase from a quality site that is about your niche should be your priority.\n  That does not mean other links may not be valuable. Only the most relevant links should be your target.\n  ## 2.2 What Is Google PageRank (PR)?\n  In the past, there was a Google Toolbar that provided a PageRank (PR) number of 0 to 10 to indicate how valuable a site was for SEO.\n  Google [eliminated visible toolbar PR](https://www.searchenginejournal.com/google-pagerank-official-shuts-doors-public/161874/) on April 16, 2016, but SEOs believe that Google still uses an internal PR calculation.\n  For more information about the importance of Google’s PR (even though we cannot see it), read Bruce Clay’s [What is PageRank](https://www.bruceclay.com/blog/what-is-pagerank/).\n  Ahrefs, Moz, and Majestic calculations are used by SEOs in place of Google PR to evaluate sites today.\n  ## 3.\tTypes of Links\n  People use a variety of different types of links. It is useful to know the standard terminology so that you can make inquiries accurately and follow the latest research. Here are some common types defined:\n* Homepage link: a link that goes to the primary domain URL\n* Branded link: company name used as anchor text, typically linked to the home page\n* Editorial link: editorial content linked to a comprehensive blog post or other informative, long-form content\n* URL link: a link to yourdomain.com\n* Image alt tag anchor text\n* Brand + keyword anchor text\n* Title anchor text: a link whose anchor text is the title of content on your site\n* Naked link: any variation of anchor text using a URL including those starting with http, www, or just domain.com. (Examples: www.yourdomain.com, http://yourdomain.com, http://www.yourdomain.com, https://yourdomain.com, or https://www.yourdomain.com)\n  While some SEOs insist that it is essential to include naked links while linkbuilding, most writers consider them unnatural and almost never use them.\n  Mike Friedman argues that naked links are not necessary in [this research](https://theseopub.com/naked-url-links-are-not-that-natural/). Publishers and writers would probably prefer you leave them out of content you request.\n  ## 3.1 What Are Nofollow Links?\n  When commenting in blogs became commonplace, Google introduced the practice of adding code to a link to make it “no follow”.\n  That is not accurate because robots do appear to follow these links. We know that because they get indexed in search engines.\n  “No juice” might be more accurate. In theory, links that have the nofollow attribute do not pass what used to be called Google PageRank (PR).\n  ## 3.2 What Are DoFollow Links?\n  Until Google introduced nofollow links, there was no such thing as a “do follow” link. Unless a link has a nofollow attribute added to the HTML, it is naturally a dofollow link.\n  Dofollow links are considered more valuable for SEO rankings because they pass “link juice”.\n  ## 4.\tWhat is Anchor Text?\n  The words that make up the part of the text that contains the actual link you click on to visit another page are the anchor text.\n  Example: In this sentence, [click here](https://smallbiztrends.com/2010/02/how-to-use-keywords.html) (typically highlighted in blue and often underlined) is the anchor text. If you want to start a huge debate, argue whether you should use “click here” as anchor text to encourage clicks or not use “click here” because it has no direct value for ranking purposes. \n  ## 4.1 Exact Match Anchor Text\n  An exact match anchor text is a link that includes only the specific targeted keyword phrase. For example, if your target phrase were “link building” the anchor text would be [link building](https://www.vazoola.com/resources/link-building-strategies-2018).\n  Exact match anchor text is not as necessary today as it once was because search engines now use semantic search. [Read this](https://www.seoclarity.net/blog/semantic-search-the-most-misunderstood-concept-in-seo) to understand what it is.\n  ## 4.2 Partial Match Anchor Text\n  Partial match anchor text would contain only some of your keyword phrase or additional words.\n  Here are some examples for a partial match of the phrase “link building” in the following sentence: “Read this to learn link building safely.”\n* Read this to learn [link](https://www.vazoola.com/resources/link-building-strategies-2018) building safely.\n* Read this to learn link [building](https://www.vazoola.com/resources/link-building-strategies-2018) safely.\n  Notice that only the word “link” or alternately, the word “building” would be part of the anchor text.\n  Another method of doing partial match phrases is to include other words:\n* Read this to [learn link](https://www.vazoola.com/resources/link-building-strategies-2018) building safely.\n* Read this to learn link [building safely](https://www.vazoola.com/resources/link-building-strategies-2018).\n  See how we created partial match phrases for “learn link” and “building safely” in the anchor text above?\n  ## 4.3 Latent Semantic Index Keywords (LSI)\n  Neil Patel uses [Latent Semantic Index Keywords (LSI)](https://neilpatel.com/blog/anchor-text/) even though he acknowledges that some feel they are [ineffective](https://www.searchenginejournal.com/latent-semantic-indexing-wont-help-seo/240705/). It can’t hurt if not overdone.\n  ## 4.4 How Anchor Text is Evolving Over Time\n  Each site owner or writer online tends to link in different ways. At one time, writers would choose the phrase that best describes the page where each link lands.\n  But due to pressure from Google, links today will often intentionally avoid using that type of keyword phrase.\n  On prominent sites, you will often see anchor text that says “research shows” or “according to” some source rather than anchor text indicating what type of research or what the source discussed.\n  ## 4.5 Be Careful With Exact Match Anchor Text\n  There was a time when it was common practice to use exact match anchor text. So if you wanted to rank for “link building” you would get others to link to you using the anchor text phrase “link building”.\n  If you do that too much today, Google’s Penguin algorithm is likely to penalize your site. Cautious SEOs now only build one exact match link per phrase.\n  Others with premium tools will build based on the percentage of other types of links. A natural link profile has varying ratios of anchor text types.\n  ## 4.6 The Importance of Co-Occurrence\n  By including additional words from your target keyword phrase close to your anchor text, you can increase the value of links without the risk of using too much exact match anchor text.\n  Here’s an example. If the brand name Vazoola often appears near the words “[link building](https://www.vazoola.com/resources/link-building-strategies-2018)”, Google will assume that our site is relevant for searches about link building even though the brand name was not linked.\n  ## 4.7 Understanding Co-Citations\n  Some SEOs theorize that if a third site mentions two sites as being correlated with each other, Google will recognize a relation between those two sites.\n  [According to this post](https://www.searchenginejournal.com/co-citation-and-co-occurrence-the-next-big-thing-in-seo/60724/) on Search Engine Journal, co-citations can be an important ranking factor.\n  ## 5.\tWhat is a Natural Link Profile?\n  Building links is not without risk. It is critical to build your backlink profile naturally. You want your link profile to appear organic.\n  Avoid focusing only on exact match phrases unless you have done extensive research and know the percentages by type of links pointing at your site.\n  The safest method is to build one link per exact match phrase. Be sure to have a mix of all other link types such as partial match, branded, editorial, URL, and naked.\n  ## 5.1 Average Percentages of Types of Links\n  There is no consensus on exact percentages. Some SEOs treat this information as valuable proprietary and confidential data.\n  Others have shared their advice publicly. Note how low the exact match percentages are.\n  ## 5.2 Gotch SEO Anchor Text Percentages\n  In Gotch SEO’s [Anchor Text updated for 2018](https://www.gotchseo.com/anchor-text/), Nathan Gotch recommended:\n* 70% branded\n* 20% naked\n* 5% generic\n* 1-5% LSI or partial match or titles\n* Exact match less than 1%\n  In an interview, he said that the naked link percentages will usually come from business listings, press releases, profile links, etc. and not contextual placements.\n  And the reason he recommends such a high percentage of branded links is to keep people out of trouble getting too many anchor text links.\n  ## 5.3 Serpstat Anchor Text Percentages\n  In [October 2017, Serpstat suggested](https://serpstat.com/blog/anchor-text-what-is-it-and-how-to-optimize-it/):\n* Branded anchor text: 50%\n* Naked links: 20%\n* Generic anchors: 5%\n* LSI, partial match anchors: 1-5%\n* Exact match anchor text: 1-2%\n  As you can see, their recommendations are very similar.\n  ## 6.\tFeatured Snippets\n  What is better than ranking #1 for a search phrase? Having your site at the top of the page in a [Featured Snippet on Google](https://www.blog.google/products/search/reintroduction-googles-featured-snippets/) can be even better. (Some are calling this position 0.)\n  An estimated 30-40% of searches are already showing Featured Snippets. Google is likely to continue to increase this number, so targeting these is a good strategy.\n  Ignore these at your peril. Many sites are seeing their traffic go down even though they still rank in the same place.\n  Ahrefs research shows that clicks on these Featured Snippets are garnering an average of about 8.6% of clicks.\n  Optimizing for Featured Snippets can be a substantial competitive advantage. The first step is to build links to rank within the top 10 listings.\n  ## 6.1 Ahref’s How to Find and Steal Featured Snippets Manually\n  Ahrefs created a post and video on how to manually find Snippets you already own and how to acquire more.\n  In it, they advise:\n* \\#1 Find and optimize Featured Snippets you already own (so you keep them)\n* \\#2 Win more Snippets by optimizing your pages that rank in the top 10 positions\n* \\#3 Find Stealable Featured Snippets\n  ## 6.2 Automated Featured Snippet Tools\n  Ahrefs is not the easiest way to optimize for Featured Snippets. There are new, specialized tools to guide you.\n  Get a jump on your competitors by using Ann Smarty’s Featured Snippet Resources and videos on [how to do Featured Snippet Optimization](https://featuredsnippettool.com/index/resources).\n  [Ninja Tools created the Featured Snippet tool](https://featuredsnippettool.com/) shown in the image below:\n  ![Featured Snippet](/images/uploads/featured-snippet-tool.jpg)\n  The tool finds and analyzes the 2000 most valuable keyword phrases for your site that are already in the top 15 positions on Google.\n  \\[Note: Research shows that you need to move up to the top 10 to capture a Featured Snippet 99+% of the time.]\n  It shows the Featured Snippets you already own so you can optimize those to make sure you keep them.\n  Their “Low Hanging Fruit” feature points out the Featured Snippets that you can most easily capture because your site already ranks higher than the site being featured.\n  Other data includes what type of Snippets Google shows for:\n* keyword research\n* best tags to use\n* searches related to\n* people also ask\n  Use this data to optimize your pages.\n  There is also a less sophisticated [Rank Ranger Featured Snippet Tool](https://www.rankranger.com/documentation/featured-snippet-tool).\n  ## 7.\tAvoid These Common Mistakes\n  Many people end up with a very unnatural looking profile similar to the one in this image:\n  ![Link Profile](/images/uploads/link-profile.jpg)\n  The reason this happens is that they do not want to pay to acquire links that are under DA30 and they don’t know how to get mentioned on the most significant sites.\n  It is a mistake to only end up with links from sites with mid-range DAs. Vazoola is perfect to help you with both higher and lower end sites.\n  ## 8.\tMonitoring Your Backlink Profile\n  Whether you are actively building backlinks or relying on gaining them organically, it is essential to monitor your backlink profile.\n  Incoming links should be a mix of types of anchor text and also sources. Too many so-called SEOs with little knowledge will focus on links that are auto-approved and end up with backlink profiles so unnatural they can get your site penalized.\n  For example, while links in comments are easy to get, they are low value and typically nofollowed. Too many comment or forum links can be dangerous when you do not have other types of links to balance them out.\n  ## 8.1 Negative SEO\n  Monitor your backlinks to detect negative SEO so you can work on recovery quickly. Waiting until your income drops dramatically can be costly.\n  While Google claims it can detect negative SEO so that it will not affect your site, some have fallen victim to it.\n  For more information, read Search Engine Land’s post on [6 types of negative SEO and how to protect your site](https://searchengineland.com/6-types-negative-seo-watch-272881).\n  According to Neil Patel, negative SEO definitely exists. He offers tips on [how to protect your site from negative SEO here](https://neilpatel.com/blog/spammers-and-negative-seo/).\n  ## 8.2 Google Advice on Viewing Incoming Links\n  Both Matt Cutts and John Mueller have [publicly stated](https://www.searchenginejournal.com/google-recommends-no-longer-using-link-operator/183532/) that using the link:URL command should not be used to find incoming links.\n  Google advises using the “Links to Your Site” report found under the Search Traffic category in the [Google Search Console](https://search.google.com/search-console)."
}