{
  "type": "Article",
  "title": "How to Get to the Top of Google in a Featured Snippet ",
  "real_title": "How to Get to the Top of Google in a Featured Snippet ",
  "keywords": "Featured Snippet",
  "date": "2018-10-02T18:46:23.738Z",
  "thumbnail": "/images/uploads/how-to-get-to-the-top-of-google-in-a-featured-snippet.jpg",
  "summary": "While organic traffic is becoming more competitive and Google’s algorithms keep evolving, it is more important than ever for website owners to take action and not lose their rankings. ",
  "body": "While organic traffic is becoming more competitive and Google’s algorithms keep evolving, it is more important than ever for website owners to take action and not lose their rankings. One way is to take advantage of Googles featured snippet.\n\n## What are Featured Snippets?\n\nWhen someone runs a search query in Google, sometimes a result will show up in a block at the top of the results. This block is called a featured snippet also known as a quick answer box. \n\nIncluded in the snippet is a link to the webpage, a summary of the search result, the title of the page, and the URL. They appear on the top of organic search below the paid ads. \n\nSEOs strive to get ranked #1 for a search phrase, however, getting content as a featured snippet on Google is even better as it is [considered to be position O](https://www.vazoola.com/resources/white-paper/new-for-2018-the-ultimate-link-building-guide). \n\nIf you can get your content into a Google featured snippet, not only will you increase your visibility, you will get a [higher organic click-through rate](https://blog.hubspot.com/marketing/how-to-featured-snippet-box).\n\n## How do Featured Snippets Affect SEO?\n\nGoogle searches bring up featured snippets before other organic results. Many people don’t go beyond the featured snippet resulting in much less traffic and fewer clicks to everything else on the first page.  \n\nWhat this means is that SEOs need to expand their focus on getting their content to show up as a featured snippet to maintain their search traffic.\n\n## What are the Different Types of Snippets?\n\nThere are primarily four types of snippets: \n\n### Paragraph\n\nThis is the most common type providing direct answers to search queries. It’s best to phrase your content in the form of a question such as:\n\n* How to…\n* How does…\n* What is…\n* How do…\n\n### List-based\n\nWhen searchers are looking for a set of steps to get something done, Google will show the query responses in a numbered list snippet. Examples of search terms that can be used to get featured in a numbered list are:\n\n* Clean out your furnace\n* How to get your home ready for sale\n* How do you properly wash a car\n\nNotice that sometimes snippets for “how to” and “how do” and similar phrases are list-based and other times they are paragraphs or videos. \n\n### Tables\n\nTables are often used for lists, statistics, and pricing. Google will sometimes [pull only the most useful information](https://www.oberlo.com/blog/google-featured-snippet) from a page and create its own table in answer to a user’s query.\n\n### YouTube\n\nYouTube videos are also pulled into featured snippets so be sure to optimize your videos as well. For example, you can answer your target audiences’ questions in the text of your video description and in the title. \n\n## Which Type is Best?\n\nDepending upon the niche your business is in, will help you determine which type of snippet is best suited for you. \n\nFor example, local businesses should try to get positioned for Google maps results. [Stat Search Analytics](https://getstat.com/blog/featured-snippets/) found that featured snippets do not appear in the SERPs that display the [local pack](https://searchengineland.com/google-updates-the-local-pack-showing-3-instead-of-7-local-results-227368) instead.\n\nIf you are in a market that has a need for specific answers to frequently asked questions, you can use your niche-specific terms that provide an explanation or present your data in a table format.\n\nBen Goodsell from SearchEngineLand.com reports that the click-through rate (CTR) on a webpage that has a [featured snippet increases from 2% to 8%](https://www.oberlo.com/blog/google-featured-snippet). This jump in CTA increases organic traffic by 677%.\n\n## Start with Keyword Research\n\nAherf reports that [99.58% of featured snippets](https://ahrefs.com/blog/featured-snippets-study/) are pulled from pages that are already in the top 10 ranking positions in the SERPs.\n\nMoz reports that most featured snippets are [triggered by long-tail keywords](https://moz.com/blog/optimize-featured-snippets) as was found in many studies. \n\nIf you haven’t already done your keyword research, you need to do so. When trying to rank for featured snippets, take the following suggestions into account:\n\n* Use explicit words that either directly or indirectly answer questions such as: Like\n  , How, Why, What, Who, Does, Costs, Cause, Getting\n* Phrases of six or more words tend to show more featured snippets.\n* Focus more on high-volume search terms as they tend to get featured snippets more often than low-volume terms.\n* To increase your chances of getting paragraph featured snippets, focus on implied questions. For example, for a search term like “[link building](https://www.vazoola.com/resources/article/link-building-strategies-2018)”, the question implied and searched for is “How can I build links?”\n\nIf you aren’t already ranking for your search terms on page one of Google, your chances of landing a featured snippet are greatly reduced. \n\n## What Questions Should You Answer?\n\nChoose one of the main questions your site is intended to answer. Using very basic language, type your question into Google search. Don’t use fancy or technical terms. Format your question as you would speak it.\n\nTake a look at any featured snippet that shows up in the results. If you see your competitor, refine the search term and make your answer better than theirs.\n\n## Manually Find and Steal Featured Snippets\n\nAhref’s suggests three ways to find and steal Google featured snippets. You can watch their [video](https://www.youtube.com/watch?v=-p0XyoO1WSA), read their [blog post](https://ahrefs.com/blog/find-featured-snippets/) for a more detailed explanation, and see a summary below. \n\n* Find and then optimize featured snippets that you already have and make sure you keep them.\n* Optimize your web pages that are already ranked in the top 10 search positions to win more snippets.\n* Find and steal competitors’ snippets by making your content and answer better than theirs.\n\nUse Automated Tools\n\n[Rank Ranger](https://www.rankranger.com/documentation/featured-snippet-tool) offers a featured snippet tool that will provide you with a list of keywords and phrases that have already won a featured snippet for the top 20 competitors or the primary domain. \n\nFor a more sophisticated approach, check out the Ninja Tools Featured Snippet Optimization Tool Ann Smarty covers in these featured [videos and snippet resources](https://featuredsnippettool.com/index/resources). \n\n## Structure Your Content\n\nYou are going to have to make some modifications to your existing content optimization strategies if you want to get into Google's featured snippets. [Search Engine Journal ](https://www.searchenginejournal.com/how-to-get-featured-snippets-google/233743/)recommends the following:\n\n* Include a how-to page on your website.\n* Use easier-to-read shorter paragraphs with a subheading containing a long-tail keyword.\n* Write posts in an FAQ style to maximize using question form keyword phrases.\n\nUse a combination of the following styles:\n\n* Images\n* Bullet points\n* Charts\n* Numbered lists\n* Steps\n* Tables\n\nStart by analyzing and understanding the terms you are currently ranking for before you work on earning featured snippets. \n\nYour next steps should be to look at how your content is structured and re-optimize it based on the above suggestions.  \n\nBe sure to hold onto the featured snippets you might already have to prevent competitors from stealing them. \n\nLook for low-hanging featured snippets opportunities. These are where you are already ranking in the top 10 search positions, as well as ones owned by your competitors that you can steal.\n\nLearn more about featured snippets and other important aspects of link building in our FREE New 2018 Ultimate Link Building Guide. [Download your own copy today](https://go.vazoola.com/ultimate-link-building-guide).\n\n[<img src=\"/images/uploads/get-free-link-building-guide.jpg\">](http://go.vazoola.com/ultimate-link-building-guide)"
}