{
  "type": "Article",
  "title": "How to Do Keyword Research the Right Way",
  "real_title": "How to Do Keyword Research the Right Way",
  "keywords": "Keyword research",
  "date": "2018-09-01T18:20:25.788Z",
  "thumbnail": "/images/uploads/how-to-do-keyword-research-the-right-way.jpg",
  "summary": "If you want your target market to find your site before your competitors’, you need to have a solid plan, and that plan begins with keyword research.",
  "body": "Where do you want to be found in search? Page 1 or page 100? How often do you go beyond the first or possibly the second page of search results?\n\nIf you want your target market to find your site before your competitors’, you need to have a solid plan, and that plan begins with keyword research.\n\n[Keeping up with Google](https://blog.hubspot.com/marketing/how-to-do-keyword-research-ht) and all their algorithm updates is a full-time job that keeps us on our toes. While the specific ways Google ranks a website are continually changing, one aspect that has remained relatively the same is the need for sites to be optimized for search. \n\nThis means knowing what terms your potential customers are putting into search queries to find products they want to purchase, the answers to their questions, or the solutions to their problems. \n\nNot all traffic is created equal. Getting visitors to your website is not your only goal. You want to attract the right audience. \n\nWhat good would it do your business if people who are not interested in your products or services land on your website? \n\n[Neil Patel](https://neilpatel.com/blog/keyword-research-smart-way/) emphasizes the importance of using the right keywords for search engine optimization (SEO), PPC, and content marketing. He summarizes the process of finding the right keywords as:\n\n* Start with a seed list of baseline keywords and phrases relevant to your business offerings as your foundation \n* Use keyword research tools to expand your list\n* Refine your list by doing competitive research\n\nKeyword research is so important to Neil Patel that he bought and improved the Ubersuggest Keyword Research Tool. For some useful strategies on how to use this tool, see: [Powerful Keyword Research: the Key to Attracting More Traffic](http://growmap.com/powerful-keyword-research/).\n\n## Your Keyword Research Foundation\n\nTo not miss any important topics as you move forward, make sure your seed list is thorough. [HubSpot suggests](https://blog.hubspot.com/marketing/how-to-do-keyword-research-ht) starting your list by putting the topics you want to rank for in buckets. \n\nThey recommend using between 5 and 10 topic buckets as the basis for what will be your eventual specific keywords and phrases.\n\nThe best way to come up with topics or subjects your target market is interested in is to put yourself in their shoes. If you are looking for what your company offers, what terms would you put into a search? \n\nFor example, Vazoola helps clients build links and leverage influencers. Our buckets would contain general topics such as \"SEO\", \"link building\", \"content marketing, \"influencer outreach\", and \"guest blogging\".\n\nSome suggestions on how to identify your seed keywords are:\n\n* Use words that describe your products or services.\n* Analyze what people are searching for on your site. You can look at what they search, social media posts, blog comments, and support tickets.\n* Use Google’s related search function. See an example below of a related search for “link building”.\n\n![Google-related search function](/images/uploads/google-related-search-function.jpg)\n\n## Keyword Research Tools\n\nThere are many free and paid keyword research tools available to help you target the right audience to increase your traffic, get more leads, convert more to customers, and grow your business.\n\nIn addition to the [Ubersuggest tool](https://neilpatel.com/ubersuggest/) recommended above, [Robbie Richards](https://www.robbierichards.com/seo/best-keyword-research-tool/) asked 127 Search Marketing Experts the question: _\"If you could only use three tools for keyword research, which three would you choose\"_? The tools most recommended are:\n\n1. SEMrush \n2. Keyword Tool.io \n3. Ahrefs \n\n## SEMrush\n\nConsidered an “all-in-one marketing tool”, [SEMrush](https://www.semrush.com/kb/15-getting-started) makes it easier for businesses to analyze the market and their online competition. \n\nTheir software includes tools for SEO and paid PR, traffic, content, and social media. Many SEO experts value the competitive research tool SEMRush provides.\n\nUnderstanding what your online competition is ranking for provides you with invaluable usable data when building your strategy to increase your organic visibility. \n\nKnowing who you are competing with for specific keywords will enable you to try to identify unique keyword phrases that are not currently being targeted to gain market advantage. \n\n## Keyword Tool.io\n\nWhen building your keyword bucket, Keyword Tool.io is one of the big picture tools that can be very helpful in identifying a list of long-tail keyword suggestions. \n\nGetting an understanding of what people are searching for around your business offerings can help you use the suggestions for SEO, content creation, PPC, and other online marketing activities.\n\nThe free version allows you to:\n\n* Generate search term suggestions for up to 750 long-tail keywords\n* Use the tool without opening an account or providing an email address\n* Reliably generate keyword suggestions and claims to work [99.99% of the time](https://keywordtool.io/)\n\n## Ahrefs\n\nThe last phase of the keyword research process described above is to refine your final list of search terms. \n\nAhrefs is a powerful toolkit to help you research your competitors, monitor your niche market, and grow your organic traffic by [providing useful metrics](https://ahrefs.com/) to give you a close-up view. \n\nTo outrank your competitors, you need to have insights into how and why they are ranking. Some of the tools in the Ahrefs’ kit include:\n\n* Keyword research\n* Rank tracking\n* Content analysis\n* Web monitoring\n* Backlink research\n* Competitive analysis\n\n[Brian Dean, the founder of Backlinko, says](https://backlinko.com/seo-tools): _“Ahrefs has a massive index (over a trillion links) that’s updated at least once a day. It’s also super-duper simple to use. Because of its excellent user interface and index, Ahrefs is one of the few SEO tools that I use every day.”_\n\nBecause Ahrefs’ database has over 5.1 billion keywords, it can help you identify keyword suggestions that other tools might miss. \n\nRefining Your List\n\nOnce you have set your foundation for your keyword research, this next step is the most important. It is where you zero in and focus on the most relevant keywords for your business that will have the highest likelihood of converting.\n\nDon’t make the mistake of putting too much emphasis on rankings while overlooking the most important reason you want to rank in the first place. Conversions pay your bills, not rankings. Some of the factors to consider when refining your list are:\n\n•\tCompetition for a specific keyword or phrase\n\n•\tThe volume of search\n\n•\tAdditional terms that are relevant to your business\n\nThere are both free and paid keyword research tools you can use to help you hone in on the most effective keywords and phrases that are most likely to convert for your target market. \n\nHowever, they will not help you understand the search behavior, demographics, characteristics, and preferences of your ideal customer.  \n\nEffective SEO writing requires a balancing act between writing for search engines and writing for your human audience. \n\nSome factors to consider are:\n\n•\tKeyword or phrase competition: Ranked from low to high by Google, you need to understand that the more competitive words will be more challenging to rank for than the less competitive ones\n\n•\tDiscard terms that are ambiguous: Try searching for your keywords or phrases. If you see results that are not exactly what you are targeting, remove them from your list\n\nFor more details about specific keyword research tools that will help you refine your list, see: SEO Keyword Research Tools to Improve Your Keyword List.\n\nTo remain competitive, giving due diligence to your keyword research strategy should be a top priority. Those who use the right words and phrases will be the companies who succeed far better than those who don't."
}