{
  "type": "Article",
  "title": "Julie's scratch pad",
  "real_title": "Julie's scratch pad",
  "keywords": "Julie's scratch pad",
  "date": "2018-08-23T13:47:19.568Z",
  "summary": "Julie's scratch pad",
  "body": "RYAN: This sentence is in the other section but NOT linked. I am repeating it here WITH the link: \n\nTo better understand how to protect your sites from a Panda penalty, read Searchmetrics post [5 ways to definitely get hit by a Panda algorithm penalty](https://blog.searchmetrics.com/us/2014/09/23/5-ways-to-definitely-get-hit-by-a-panda-algorithm-penalty/).  \n\n## 11.2 Penguin Penalty\n\nFirst introduced in April 2012, the Penguin algorithm dropped rankings for sites with unnatural inbound links. \n\nPenguin initially was updated periodically, so any link clean-up done on a site would not change rankings until another Penguin update occurred. \n\nBetween September and October 2016, a new real-time Penguin 4.0 was fully rolled out. See Ignite Visibility’s research for complete details on the [history of Penguin through 2018](https://ignitevisibility.com/google-penguin-update/). \n\nThe most cautious SEOs avoid tripping Penguin by using a specific phrase as anchor text only once. They also keep their exact match anchor text phrases under 1-2% of all links.\n\nAdvanced SEOs actively monitor the percentages of link types to ensure a natural balance so that they may use the same exact match anchor text more than once. \n\nFind out [How to Remove a Penguin Penalty from 58 SEOs Who Share Their Tips](https://niksto.com/penguin-penalty/).\n\n## 11.3 Mobile Friendly Ranking Factor\n\nAlthough this may or may not actually be a “penalty”, Google has [announced](https://webmasters.googleblog.com/2015/02/finding-more-mobile-friendly-search.html) that sites that are not mobile friendly will have their rankings lowered. \n\nThey also show a “mobile friendly” label in the SERPs. (SERPs is a common SEO term that stands for search engine ranking pages or search engine results pages.) \n\n## 12.\tSEO Tools\n\nSerious link builders use a combination of free and premium tools. The ones discussed below are the most commonly recommended. \n\nIt is nearly impossible to decide which is best because they have different strengths and weaknesses. \n\nAdvanced SEOs use many premium tools with monthly fees. Choose wisely to minimize your monthly expense. \n\nStart with the free tools and then add a premium tool. Once you have thoroughly learned it, then you can consider additional paid tools. \n\nThe list below is not complete because there are so many SEO tools, but it does cover the best-known and most-often mentioned. \n\n## 12.1 Ahrefs  \n\nAhrefs define themselves as competitor research tools and an SEO backlink checker. In a post updated in early July 2018, they wrote, _“At the moment we stand out from the herd of other similar services by the largest base of Live links, huge Index and the best Speed of index updates.” _\n\nAhrefs announced their [Domain Rank (DR)](https://ahrefs.com/blog/domain-rating/) calculation in January 2018. They also have [other metrics](https://ahrefs.com/blog/seo-metrics/) including URL Rating (UR), Domain Rating (DR), Ahrefs Rank (AR) and Keyword Difficulty (KD). \n\nDid you know that [Ahrefs has a free toolbar for Chrome](https://ahrefs.com/seo-toolbar) to make it fast and easy to pull their metrics? \n\nTools offered by Ahrefs are: \n\n* [Site Explorer](https://ahrefs.com/site-explorer/) for analyzing backlinks of your site and competitors\n* [Content Explorer](https://ahrefs.com/site-explorer/) to find the most shared content on any topic\n* [Keywords Explorer](https://ahrefs.com/keywords-explorer) for keyword research\n* [Rank Tracker](https://ahrefs.com/rank-tracker) tool to track desktop and mobile rankings for any location; includes the ability to run daily, weekly, and monthly reports\n* [Site Audit](https://ahrefs.com/site-audit) tool to find common SEO issues and monitor your site’s SEO health\n* Alerts notifying you of new & lost backlinks, web mentions, keywords rankings\n\nBe aware that even paid plans have limits on the number of searches you can do. So keep that in mind when using this tool. \n\nThere are comprehensive guides online to make it easier to get the most out of these powerful SEO tools including Nathan Gotch’s [Ahrefs: The Ultimate Guide](https://www.gotchseo.com/ahrefs/)."
}