{
  "type": "Article",
  "title": "Julie's scratch pad",
  "real_title": "Julie's scratch pad",
  "keywords": "Julie's scratch pad",
  "date": "2018-08-23T13:47:19.568Z",
  "summary": "Julie's scratch pad",
  "body": "RYAN: This sentence is in the other section but NOT linked. I am repeating it here WITH the link: \n\nTo better understand how to protect your sites from a Panda penalty, read Searchmetrics post [5 ways to definitely get hit by a Panda algorithm penalty](https://blog.searchmetrics.com/us/2014/09/23/5-ways-to-definitely-get-hit-by-a-panda-algorithm-penalty/).  \n\n## 11.2 Penguin Penalty\n\nFirst introduced in April 2012, the Penguin algorithm dropped rankings for sites with unnatural inbound links. \n\nPenguin initially was updated periodically, so any link clean-up done on a site would not change rankings until another Penguin update occurred. \n\nBetween September and October 2016, a new real-time Penguin 4.0 was fully rolled out. See Ignite Visibility’s research for complete details on the [history of Penguin through 2018](https://ignitevisibility.com/google-penguin-update/). \n\nThe most cautious SEOs avoid tripping Penguin by using a specific phrase as anchor text only once. They also keep their exact match anchor text phrases under 1-2% of all links.\n\nAdvanced SEOs actively monitor the percentages of link types to ensure a natural balance so that they may use the same exact match anchor text more than once. \n\nFind out [How to Remove a Penguin Penalty from 58 SEOs Who Share Their Tips](https://niksto.com/penguin-penalty/).\n\n## 11.3 Mobile Friendly Ranking Factor\n\nAlthough this may or may not actually be a “penalty”, Google has [announced](https://webmasters.googleblog.com/2015/02/finding-more-mobile-friendly-search.html) that sites that are not mobile friendly will have their rankings lowered. \n\nThey also show a “mobile friendly” label in the SERPs. (SERPs is a common SEO term that stands for search engine ranking pages or search engine results pages.) \n\n## 12.\tSEO Tools\n\nSerious link builders use a combination of free and premium tools. The ones discussed below are the most commonly recommended. \n\nIt is nearly impossible to decide which is best because they have different strengths and weaknesses. \n\nAdvanced SEOs use many premium tools with monthly fees. Choose wisely to minimize your monthly expense. \n\nStart with the free tools and then add a premium tool. Once you have thoroughly learned it, then you can consider additional paid tools. \n\nThe list below is not complete because there are so many SEO tools, but it does cover the best-known and most-often mentioned. \n\n## 12.1 Ahrefs  \n\nAhrefs define themselves as competitor research tools and an SEO backlink checker. In a post updated in early July 2018, they wrote, _“At the moment we stand out from the herd of other similar services by the largest base of Live links, huge Index and the best Speed of index updates.” _\n\nAhrefs announced their [Domain Rank (DR)](https://ahrefs.com/blog/domain-rating/) calculation in January 2018. They also have [other metrics](https://ahrefs.com/blog/seo-metrics/) including URL Rating (UR), Domain Rating (DR), Ahrefs Rank (AR) and Keyword Difficulty (KD). \n\nDid you know that [Ahrefs has a free toolbar for Chrome](https://ahrefs.com/seo-toolbar) to make it fast and easy to pull their metrics? \n\nTools offered by Ahrefs are: \n\n* [Site Explorer](https://ahrefs.com/site-explorer/) for analyzing backlinks of your site and competitors\n* [Content Explorer](https://ahrefs.com/site-explorer/) to find the most shared content on any topic\n* [Keywords Explorer](https://ahrefs.com/keywords-explorer) for keyword research\n* [Rank Tracker](https://ahrefs.com/rank-tracker) tool to track desktop and mobile rankings for any location; includes the ability to run daily, weekly, and monthly reports\n* [Site Audit](https://ahrefs.com/site-audit) tool to find common SEO issues and monitor your site’s SEO health\n* Alerts notifying you of new & lost backlinks, web mentions, keywords rankings\n\nBe aware that even paid plans have limits on the number of searches you can do. So keep that in mind when using this tool. \n\nThere are comprehensive guides online to make it easier to get the most out of these powerful SEO tools including Nathan Gotch’s [Ahrefs: The Ultimate Guide](https://www.gotchseo.com/ahrefs/). \n\n## 12.2 Majestic SEO\n\nMajestic bills itself as link intelligence tools for SEO, Marketing, and Internet PR. There are huge debates whether Ahrefs or Majestic has a more extensive database of links. \n\nThey also claim to have “The planet’s largest Link Index database”. Majestic and Ahrefs tend to run neck-and-neck for that claim. \n\nMany SEOs prefer one over the other. There is no consensus regarding which one is best. \n\nThe [Majestic SEO toolbar](https://majestic.com/majestic-widgets/plugins) data is free to access. The Majestic toolbar provides the valuable [Flow Metrics ™](https://blog.majestic.com/development/flow-metrics/) for Citation Flow and Trust Flow. \n\nTheir Starter Plan (Lite) has access to their Fresh Index and other commonly used features. \n\nUpgrade to the Pro version to access their Historic Index, other history metrics, and additional features. \n\nMajestic provides [SEO training videos](https://blog.majestic.com/how-to-videos/) to make their many tools easier to learn. \n\n## 12.3 LinkResearch Tools\n\nNot as commonly known, [LinkResearchTools](https://www.linkresearchtools.com/) claims to be able to “simulate the danger of a potential new link” so site owners can avoid Google penalties.  \n\nThey offer a free toolbar and premium tools. \n\n## 12.4 Moz Toolbar\n\nThe free Moz Toolbar is probably the most popular of all the tools because their Moz metrics are widely used to evaluate the quality of websites online. Those metrics were discussed earlier in this white paper. \n\nWhile many writers and site owners use the free Moz Toolbar, fewer know what the difference is between it and Moz Pro. The premium version includes: \n\n* Keyword explorer for keyword research\n* Link profile analysis\n* On page optimization\n* Open site explorer\n* Rank tracking\n* Site Crawl\n\nTheir Content tool was shut down to focus on the SEO tools. Find out more about Moz Pro by reading this updated [2018 Moz Pro review](https://www.martechwiz.com/tools/moz-pro-review/). \n\n## 12.5 SEMrush\n\nBilling themselves as an “all-in-one marketing toolkit”, SEMrush provides tools for SEO, and also paid traffic, social media, content, and PR. \n\nTheir SEO tools include: \n\n* Backlinks audit and analytics\n* Competitive intelligence\n* Ideas for gaining more organic traffic\n* A “not provided” problem solution\n* Position tracking\n* Semantic core collection\n* Technical SEO Audit\n\nTo find out more, read their [SEMrush getting started guide](https://www.semrush.com/kb/15-getting-started). \n\nSEMrush also has their version of SEO metrics they call [SEMrush traffic scores](https://www.semrush.com/kb/747-authority-score-backlink-scores). These include:\n\n* Authority score\n* Page score\n* Domain score\n* Trust score\n\nThe Authority score combines the other scores to measure the overall quality of a domain. \n\nWhen deciding which metrics to use, the G2 crowd [Ahrefs versus SEMrush comparison](https://www.g2crowd.com/compare/ahrefs-vs-semrush) can be useful. \n\n## 13.\tSEO Crawling Tools\n\nThere are multiple crawling tools. Again, there is no consensus regarding which is best. Here are some top choices: \n\n## 13.1 DeepCrawl\n\n[DeepCrawl](https://www.deepcrawl.com/) is a web-based application used to “analyze your website architecture to understand and monitor technical issues to improve SEO performance”. \n\nOnline Performance Agency Roast said, \"Using DeepCrawl means we can spend more time making recommendations and changes and less time trawling through the data\". You can see their [case study here](https://www.deepcrawl.com/case-studies/roast-case-study/). \n\n## 13.2 Screaming Frog\n\nThe [Screaming Frog SEO spider tool and website crawler](https://www.screamingfrog.co.uk/seo-spider/) _“is a desktop website crawler and auditor for PC, Mac or Linux which spiders websites’ links, images, CSS, script and apps like a search engine to evaluate onsite SEO.”_\n\nIf you have less than 500 URLs, you can use their free version unless you want to use their advanced features. \n\nThey also offer a [Log File Analyzer tool](https://www.screamingfrog.co.uk/log-file-analyser/) “to upload your log files, verify search engine bots, identify crawled URLs and analyse search bot data and behaviour for invaluable SEO insight”.  It also comes in a free and paid version. \n\nYou can use this tool to [find broken links](https://www.screamingfrog.co.uk/broken-link-checker/) on your site and fix them. Not repairing broken links can impact your rankings in Google and other search engines. \n\nNote that WordPress sites could also use the [Broken Link Checker plugin](https://wordpress.org/plugins/broken-link-checker/). It is best not to leave it running all the time as it consumes resources and could slow your site. \n\nFor this reason, some hosting companies forbid sites to use the Broken Link Checker Plugin. Run it, clean up your links, and disable it until you rerun it.\n\n## 13.3 Sitebulb\n\nJames Perrott of [Zazzle Media](https://www.zazzlemedia.co.uk/) said, _“Sitebulb compiles the data integrity of Screaming Frog with the UX of DeepCrawl.”_\n\nIf you’re no fan of using spreadsheets, one benefit of using Sitebulb is the reports: \n\n* Indexation Status by Depth\n* Mobile Rendering\n* Site Speed\n\nIn a [review of Sitebulb](https://builtvisible.com/sitebulb-testing-crawler-tool/) for BuiltVisible, Richard Baxter wrote, _“This tool isn’t a replacement for crawlers like Screaming Frog or products like Ryte – it’s something you’d want in addition to them”. _\n\n## 13.4 Which Crawling Tool is Best? \n\nNot sure which crawling tool you want to use? John Doherty of Credo wrote a comprehensive comparison of the [pros and cons of Screaming Frog, Sitebulb and DeepCrawl](https://www.getcredo.com/screaming-frog-alternatives/).\n\nHe also mentions that Ahrefs, Moz, and SEMrush also include crawlers. See his post for how these compare. \n\n## 14.\tData Intelligence Tools\n\n## 14.1 BuzzSumo \n\nDiscussed further under Tools for Finding Influencers, BuzzSumo is used by content creators, but also by SEOs for doing competitive research on what content is most popular for a given keyword search. \n\n(See discussion below in sectin 15.1 to learn more about BuzzSumo.)\n\n## 14.2 Kerboo Data Intelligence\n\n[Kerboo](https://kerboo.com/) is link audit software that consolidates information from multiple SEO tools. So if you have premium subscriptions to more than one, you may wish to use Kerboo. \n\n## 14.3 SEOClarity for Market Intel\n\nSEOClarity uses Artificial Intelligence (A.I.) to collect and analyze the data and turn it into reports for you. \n\n## 14.4 SEMrush\n\nSEMrush is also used for market intelligence. (Jump to discussion 12.5 above about SEMrush above.)\n\n## 14.5 SpyFu\n\nOne of the most popular competitor analysis tools related to organic and paid search is [SpyFu](https://www.spyfu.com/). Because it is so popular, you may want to see the [SpyFu reviews on G2Crowd](https://www.g2crowd.com/products/spyfu/reviews). \n\nAccording to their site, SpyFu enables users to _“Search for any domain and see every place they've shown up on Google: every keyword they've bought on AdWords, every organic rank, and every ad variation in the last 12 years.”_\n\n## 15.\tTools for Finding Influencers\n\n## 15.1 BuzzSumo\n\nBuzzSumo is the primary tool content creators use to determine which content is most popular for any given keyword phrase, who is sharing it, and how influential they are. \n\nThere are so many features inside BuzzSumo, there is too much to cover here. Head over to Backlinko’s [BuzzSumo: The Definitive Guide](https://backlinko.com/buzzsumo-guide) for details. \n\nHow good is it? I used BuzzSumo to find the best content about BuzzSumo! \n\n## 15.2 Klear\n\nAlthough not as well known as Kred once was, Klear categorizes influencers into 60,000 niches. (It doesn’t do you any good to use an influencer whose audience is not interested in what you have to offer.) \n\nUse their influencer search engine to research influencers on specific networks or who post about topics relevant to your brand. \n\n## 15.3 Klout\n\nAlthough [Klout shut down in 2018](https://smallbiztrends.com/2018/05/klout-shutting-down.html), it is mentioned here because they were once very prominent in the influencer space. Now you won’t need to waste your time looking for it. \n\n## 15.4 Kred\n\nKred is an influence score and platform. Unlike some influencer tools that provide only one number for influence, the advantage of using Kred is that they provide separate scores for influencer and outreach level. \n\n## 15.5 Leveraging Influential Content Marketers\n\nRead much more about finding influencers, content marketing, and how to get influential writers to talk about your brand in our other white paper, [Leveraging Influential Content Marketers](http://go.vazoola.com/leveraging-influential-content-marketers)."
}