{
  "type": "Article",
  "title": "The Importance of Relevance to Link Quality",
  "real_title": "The Importance of Relevance to Link Quality",
  "keywords": "Link Relevance",
  "date": "2018-10-15T22:13:09.631Z",
  "thumbnail": "/images/uploads/the-importance-of-relevance-to-link-quality.jpg",
  "summary": "Before you start building your link profile, you need to understand that all links are not created equal. Quality over quantity is the mantra of successful link building.",
  "body": "Before you start building your link profile, you need to understand that all links are not created equal. Quality over quantity is the mantra of successful link building.\n\nThis is not to say that other links might not be valuable. What it does mean is that your focus should be on getting many [relevant sites in your niche](https://www.vazoola.com/resources/white-paper/new-for-2018-the-ultimate-link-building-guide) to link to your content. \n\nOne link from a relevant site is worth more than many from websites that are not related to the content on yours. The more relevant the link, the higher the value.\n\nLinks that are not relevant or helpful to your niche should be avoided as they might be seen as manipulative by the search engines. \n\n## Focus on Building High-Quality Links\n\nRather than trying to get links from any site, professionals now spend their efforts trying to acquire links from authoritative resources and trusted sources.  \n\nWhen you spend time trying to acquire high-quality links, you will know what you are getting. You will also minimize the chances of unintentionally obtaining questionable or irrelevant links that will hurt your rankings.\n\nAn example of a quality link to your website is when a national news site writes about something relevant to your niche and links to one of your pages. \n\nReaders already trust the news site and will therefore also trust the places that are linked to from their article.\n\nWhen the search engines trust a site, they will also trust the sites it links to and give those sites an [editorial seal of approval](https://www.webpagefx.com/link-building-quality-quantity.html).\n\nKeep in mind that some larger sites use nofollow links. This means that they include HTML code that directs search engines not to follow that link.  \n\nEven though nofollow links will not help you directly, they can lead to additional links that do.\n\n## How to Measure Link Quality\n\nWhen building your link profile, how can you determine the trust and authority of any given site? Keep in mind that Google's search algorithm is set up to show the most [trustworthy and authoritative results](https://searchengineland.com/evaluating-link-quality-seo-campaigns-240123) first in a search query."
}