{
  "type": "Article",
  "title": "The Importance of Relevance to Link Quality",
  "real_title": "The Importance of Relevance to Link Quality",
  "keywords": "Link Relevance",
  "date": "2018-10-15T22:13:09.631Z",
  "thumbnail": "/images/uploads/the-importance-of-relevance-to-link-quality.jpg",
  "summary": "Before you start building your link profile, you need to understand that all links are not created equal. Quality over quantity is the mantra of successful link building.",
  "body": "Before you start building your link profile, you need to understand that all links are not created equal. Quality over quantity is the mantra of successful link building.\n\nThis is not to say that other links might not be valuable. What it does mean is that your focus should be on getting many [relevant sites in your niche](https://www.vazoola.com/resources/white-paper/new-for-2018-the-ultimate-link-building-guide) to link to your content. \n\nOne link from a relevant site is worth more than many from websites that are not related to the content on yours. The more relevant the link, the higher the value.\n\nLinks that are not relevant or helpful to your niche should be avoided as they might be seen as manipulative by the search engines. \n\n## Focus on Building High-Quality Links\n\nRather than trying to get links from any site, professionals now spend their efforts trying to acquire links from authoritative resources and trusted sources.  \n\nWhen you spend time trying to acquire high-quality links, you will know what you are getting. You will also minimize the chances of unintentionally obtaining questionable or irrelevant links that will hurt your rankings.\n\nAn example of a quality link to your website is when a national news site writes about something relevant to your niche and links to one of your pages. \n\nReaders already trust the news site and will therefore also trust the places that are linked to from their article.\n\nWhen the search engines trust a site, they will also trust the sites it links to and give those sites an [editorial seal of approval](https://www.webpagefx.com/link-building-quality-quantity.html).\n\nKeep in mind that some larger sites use nofollow links. This means that they include HTML code that directs search engines not to follow that link.  \n\nEven though nofollow links will not help you directly, they can lead to additional links that do.\n\n## How to Measure Link Quality\n\nWhen building your link profile, how can you determine the trust and authority of any given site? Keep in mind that Google's search algorithm is set up to show the most [trustworthy and authoritative results](https://searchengineland.com/evaluating-link-quality-seo-campaigns-240123) first in a search query.\n\n### Moz Domain Authority Tool\n\nMany tools will help you evaluate a site. The most common one is the [Moz Domain Authority (DA)](https://moz.com/learn/seo/domain-authority).\n\nDomain Authority (DA) is a score used by link builders to determine the estimated SEO value of a particular site. It ranges from one to 100. The higher the score, the greater the authority. \n\nThe easiest and most accurate way to use the Moz Domain Authority tool is to install their [free Chrome Extension toolbar](https://moz.com/products/pro/seo-toolbar) in your browser.\n\nOther tools also measure link quality. However, they don’t use the most recent version and are not updated as frequently. Therefore, using the toolbar will provide the most accurate data. \n\n### Human Value\n\nIt is somewhat of a balancing act to write your content and build your links for both search engines and humans. There is a real human value to links that play a vital role in their relevancy. \n\nIf a link answers the following questions, it has [human value](https://www.brainpulse.com/articles/how-to-measure-link-quality.php):\n\n* Does the link lead to useful information for the reader?\n* Does the link take the reader to the expected location?\n* Does the content on the page linked to provide the information the reader is seeking?\n* Do people click the link?\n\nAny link you build should be relevant and valuable to the reader, the site that includes the link, and the site being linked.\n\n### Avoid Spam Sites\n\nIf a link does not come from a trusted source, you should avoid it. Some examples of links to avoid are those that come from:\n\n* Article directories\n* Forums\n* Blog comments that are clearly spam \n* Many social bookmarks\n\nIf links fall into one of the categories below, you should also avoid them:\n\n* Overly salesy\n* Content is written for search engines and not humans\n* Niches that are notoriously considered spam such as payday loans and online gambling\n\nMoz will provide you with a [Spam Analysis](https://moz.com/help/link-explorer/link-building/spam-score) that you can use to help identify bad links. If you find links that are questionable or outright spam, be sure to remove them and replace them with quality links. \n\nWhen in doubt, it's better to be on the side of caution and remove the links before they negatively affect your rankings.\n\n## How to Get Quality Links\n\nBuilding a profile of quality links can be challenging and takes time. Here are a few suggestions to get you started:\n\n### Public Relations\n\nThe best way to acquire quality links via the press is to be cited online by a prominent news agency. In the past, you either had to have connections already or would have had to hire a third party with connections to publications or journalists. \n\nLuckily, today there is a resource called [HARO](https://www.helpareporter.com/) (Help a Reporter) where you can connect with journalists for upcoming stories and media coverage. \n\n### Guest Posts\n\nWhen done correctly and carefully, guest posts can provide valuable links to your site. Because some site owners took advantage of this tactic by including irrelevant, unhelpful, and poorly written content, Google has issued warnings about guest posts.\n\nThere is a considerable difference between relevant and high-quality guest posts and irrelevant low-value posts. \n\n### Skyscraper Content\n\nBrian Dean from Backlinko outlines a step-by-step process on [how to use Skyscraper content](https://backlinko.com/high-quality-backlinks) to build links from authority sites.\n\n* Start by doing a simple Google search for a keyword phrase to find content in your industry that has already performed well. \n* Look at page one of the search results because they are already ranked high for your searched keyword or phrase.\n* Write content that is better than what you see in your search results.\n\nAlthough this is not easy to do, it is well worth the effort if you do your homework promoting your content once it is published. \n\nThere is a certain amount of common sense involved in knowing what links are relevant and which ones are not. You know if a site you are looking to is relevant, helpful, and valuable to your target market. \n\nStay focused on human value, relevancy, authority, and trust when building your link profile, and in time you will be able to earn trust and develop positive relationships. \n\nWe go into more detail about the critical aspects of link building in our [FREE New 2018 Ultimate Link Building Guide](https://go.vazoola.com/ultimate-link-building-guide). Grab your copy today!"
}